import Link from "next/link";

export function ZhHant() {
  return (
    <>
      <h1>隱私政策</h1>

      <p>
        柳川村役場（以下簡稱「我們」）制定了以下隱私政策（以下簡稱「本政策」），以規範本網站提供的服務（以下簡稱「本服務」）中用戶個人資訊的處理。
      </p>

      <h2>第1條（個人資訊）</h2>
      <p>
        「個人資訊」是指個人資訊保護法中所定義的「個人資訊」，即關於在世個人的資訊，通過姓名、出生日期、地址、電話號碼、聯絡方式等描述可以識別特定個人的資訊，以及外貌、指紋、聲紋相關的數據，以及僅憑該資訊就可以識別特定個人的資訊（個人識別資訊），如健康保險卡號碼等。
      </p>

      <h2>第2條（個人資訊的收集方法）</h2>
      <p>
        在用戶註冊使用時，我們可能會詢問姓名、出生日期、地址、電話號碼、電子郵箱、銀行帳號、信用卡號碼、駕駛證號碼等個人資訊。此外，我們也可能從合作夥伴（包括資訊提供方、廣告主、廣告投放方等，以下簡稱「合作夥伴」）處收集包含用戶個人資訊的交易記錄和支付相關資訊。
      </p>

      <h2>第3條（收集和使用個人資訊的目的）</h2>
      <p>我們收集和使用個人資訊的目的如下：</p>
      <ol>
        <li>為提供和營運我們的服務</li>
        <li>
          為回應用戶的諮詢（包括進行身份驗證）
        </li>
        <li>
          為發送有關用戶正在使用的服務的新功能、更新資訊、活動等以及我們提供的其他服務的相關資訊
        </li>
        <li>為在必要時進行維護、重要通知等聯絡</li>
        <li>
          為識別違反使用條款的用戶或試圖不正當、不當使用服務的用戶，並拒絕其使用
        </li>
        <li>
          為讓用戶查看、修改、刪除其註冊資訊及查看使用狀況
        </li>
        <li>為向用戶收取付費服務的費用</li>
        <li>為實現上述使用目的所附帶的目的</li>
      </ol>

      <h2>第4條（使用目的的變更）</h2>
      <ol>
        <li>
          我們僅在變更後的目的與變更前合理相關的情況下，才會變更個人資訊的使用目的。
        </li>
        <li>
          變更使用目的時，我們將通過規定的方式通知用戶，或在本網站上公布變更後的目的。
        </li>
      </ol>

      <h2>第5條（向第三方提供個人資訊）</h2>
      <ol>
        <li>
          除以下情況外，未經用戶事先同意，我們不會向第三方提供個人資訊。但是，個人資訊保護法等法律法規允許的情況除外。
          <ol>
            <li>
              為保護人的生命、身體或財產所必需，且難以獲得本人同意時
            </li>
            <li>
              為改善公共衛生或促進兒童健康成長特別需要，且難以獲得本人同意時
            </li>
            <li>
              為配合國家機關、地方公共團體或其委託者執行法律規定的事務，獲得本人同意可能會妨礙該事務的執行時
            </li>
            <li>
              預先公布以下事項，並已向個人資訊保護委員會報告時
              <ol>
                <li>使用目的包括向第三方提供</li>
                <li>向第三方提供的數據項目</li>
                <li>向第三方提供的方式或方法</li>
                <li>
                  應本人要求停止向第三方提供個人資訊
                </li>
                <li>接受本人請求的方法</li>
              </ol>
            </li>
          </ol>
        </li>
        <li>
          儘管有前項規定，以下情況不視為向第三方提供：
          <ol>
            <li>
              在實現使用目的所必需的範圍內，將個人資訊的全部或部分處理委託給他人時
            </li>
            <li>
              因合併等原因導致業務繼承而提供個人資訊時
            </li>
            <li>
              在特定的個人或團體之間共同使用個人資訊，且已事先通知本人或使本人容易知悉以下事項時：該事實、共同使用的個人資訊項目、共同使用者的範圍、使用者的使用目的、負責管理該個人資訊的人的姓名或名稱
            </li>
          </ol>
        </li>
      </ol>

      <h2>第6條（個人資訊的公開）</h2>
      <ol>
        <li>
          收到本人要求公開個人資訊時，我們將及時向本人公開。但是，如果公開會導致以下任一情況，我們可能不會公開全部或部分資訊，並將及時通知不公開的決定。另外，公開個人資訊時，每次將收取1,000日圓的手續費。
          <ol>
            <li>
              可能損害本人或第三方的生命、身體、財產或其他權益時
            </li>
            <li>可能嚴重妨礙我們業務的正常進行時</li>
            <li>可能違反其他法律法規時</li>
          </ol>
        </li>
        <li>
          儘管有前項規定，原則上我們不會公開歷史資訊和特徵資訊等非個人資訊。
        </li>
      </ol>

      <h2>第7條（個人資訊的更正和刪除）</h2>
      <ol>
        <li>
          如果我們持有的用戶個人資訊不正確，用戶可以按照我們規定的程序要求更正、添加或刪除個人資訊（以下簡稱「更正等」）。
        </li>
        <li>
          收到前項要求並判斷有必要回應該要求時，我們將及時對個人資訊進行更正等。
        </li>
        <li>
          根據前項規定進行更正等，或決定不進行更正等時，我們將及時通知用戶。
        </li>
      </ol>

      <h2>第8條（個人資訊的使用停止等）</h2>
      <ol>
        <li>
          當收到因個人資訊的處理超出使用目的範圍或以不正當手段獲取為由而提出的停止使用或刪除請求（以下簡稱「使用停止等」）時，我們將及時進行必要的調查。
        </li>
        <li>
          根據前項調查結果，判斷有必要回應該請求時，我們將及時對該個人資訊進行使用停止等。
        </li>
        <li>
          根據前項規定進行使用停止等，或決定不進行使用停止等時，我們將及時通知用戶。
        </li>
        <li>
          儘管有前兩項規定，如果使用停止等需要高額費用或在其他方面存在困難，且可以採取必要的替代措施保護用戶的權益時，我們將採取該替代措施。
        </li>
      </ol>

      <h2>第9條（隱私政策的變更）</h2>
      <ol>
        <li>
          除法律規定或本政策另有規定的事項外，本政策的內容可以在不通知用戶的情況下進行變更。
        </li>
        <li>
          除非我們另有規定，變更後的隱私政策自在本網站上發布時起生效。
        </li>
      </ol>

      <h2>第10條（諮詢窗口）</h2>
      <p>關於本政策的諮詢，請通過以下方式聯絡：</p>
      <p>
        <b>柳川村役場</b>
        <br />
        網站：
        <Link href="https://www.yanagawa.one" target="_blank" rel="noreferrer">
          https://www.yanagawa.one
        </Link>
      </p>
    </>
  );
} 